{
    "background": "Capacitated facility location problems focus on determining the optimal placement of a certain number of facilities to serve a set number of customers in a way that minimizes the total cost, considering fixed costs, capacities, customer demands, and transport costs.",
    "constraints": [
        "Each facility has a maximum capacity of FacilityCapacity",
        "Total number of facilities to be located is NumberOfFacilities",
        "Each customer zone is served by at least one facility and its demand must be met",
        "Total output for each facility cannot exceed its capacity",
        "The number of facilities and customers is fixed and non-negative"
    ],
    "objective": "Minimize the total cost of locating facilities and transporting goods to customer zones",
    "description": "Capacitated facility location problems deal with locating \\param{NumberOfFacilities} facilities to serve \\param{NumberOfCustomers} customers, at minimum total cost. Considering potential facility locations and customer zones as fixed points in a network, each facility has a fixed \\param{FacilityFixedCost} and a \\param{FacilityCapacity}. Furthermore, there exists a \\param{CustomerDemand} for each customer zone, and a \\param{FacilityToCustomerTransportCost} representing the cost of transport between facilities and customer zones.",
    "parameters": [
        {
            "symbol": "NumberOfFacilities",
            "definition": "The number of potential facilities that can be established",
            "shape": []
        },
        {
            "symbol": "NumberOfCustomers",
            "definition": "The number of customer zones to be served",
            "shape": []
        },
        {
            "symbol": "FacilityFixedCost",
            "definition": "The fixed cost associated with establishing a facility",
            "shape": [
                "NumberOfFacilities"
            ]
        },
        {
            "symbol": "FacilityToCustomerTransportCost",
            "definition": "The cost of transporting goods from each facility to each customer zone",
            "shape": [
                "NumberOfFacilities",
                "NumberOfCustomers"
            ]
        },
        {
            "symbol": "FacilityCapacity",
            "definition": "The capacity of each facility, which limits the amount of goods the facility can handle or produce",
            "shape": [
                "NumberOfFacilities"
            ]
        },
        {
            "symbol": "CustomerDemand",
            "definition": "The demand of each customer zone that must be met by the facilities",
            "shape": [
                "NumberOfCustomers"
            ]
        }
    ]
}