{
    "background": "The problem involves assigning student groups from various neighborhoods to different schools with the aim of minimizing the total distance traveled by all students, taking into consideration the capacity of the schools and distribution of student groups.",
    "constraints": [
        "Total number of students from each student group g assigned from neighborhood n to schools does not exceed the Population of group g in neighborhood n",
        "Total number of students from each student group g assigned to school s does not exceed the Capacity of school s for student group g",
        "Each student is assigned to exactly one school",
        "All populations, capacities, and distances are non-negative"
    ],
    "objective": "Minimize the total distance traveled by all students in their assignments to schools",
    "description": "We want to assign all students to schools, while minimizing the total distance traveled by all students. We have a total number of \\param{S} schools, \\param{G} student groups, and \\param{N} neighborhoods. Each school s has a capacity for student group g represented by \\param{Capacity}. The population of student group g in neighborhood n is given by \\param{Population}. The distance between neighborhood n and school s is denoted as \\param{Distance}. We may ignore the fact that numbers of students must be integers.",
    "parameters": [
        {
            "definition": "Total number of schools",
            "symbol": "S",
            "value": "",
            "shape": []
        },
        {
            "definition": "Total number of student groups",
            "symbol": "G",
            "value": "",
            "shape": []
        },
        {
            "definition": "Total number of neighborhoods",
            "symbol": "N",
            "value": "",
            "shape": []
        },
        {
            "definition": "Capacity of school s for student group g",
            "symbol": "Capacity",
            "value": "",
            "shape": [
                "S",
                "G"
            ]
        },
        {
            "definition": "Population of student group g in neighborhood n",
            "symbol": "Population",
            "value": "",
            "shape": [
                "N",
                "G"
            ]
        },
        {
            "definition": "Distance between neighborhood n and school s",
            "symbol": "Distance",
            "value": "",
            "shape": [
                "N",
                "S"
            ]
        }
    ]
}