{
    "background": "Calcium and Magnesium are essential elements for health, and are contained in two different health supplements, A and B. A patient needs to consume these supplements to meet daily nutritional requirements at a minimum cost.",
    "constraints": [
        "Number of servings of health supplement A is non-negative",
        "Number of servings of health supplement B is non-negative",
        "Total Calcium from servings of A and B must be at least MinCa grams",
        "Total Magnesium from servings of A and B must be at least MinMg grams"
    ],
    "objective": "Minimize the total daily cost of health supplements for the patient",
    "description": "Calcium and Magnesium are found in two health supplements, health supplement A and health supplement B. One serving of health supplement A contains \\param{CaA} grams of Calcium and \\param{MgA} grams of Magnesium. One serving of health supplement B contains \\param{CaB} grams of Calcium and \\param{MgB} grams of Magnesium. The cost per health supplement for health supplement A is \\$\\param{CostA} and the cost per health supplement for health supplement B is \\$\\param{CostB}. A patient must consume these two health supplements every day to get at least \\param{MinCa} grams of Calcium and \\param{MinMg} grams of Magnesium. Determine how much servings of each supplement the patient needs to minimize her daily cost.",
    "parameters": [
        {
            "definition": "Amount of Calcium in one serving of health supplement A",
            "symbol": "CaA",
            "value": 30,
            "shape": []
        },
        {
            "definition": "Amount of Magnesium in one serving of health supplement A",
            "symbol": "MgA",
            "value": 50,
            "shape": []
        },
        {
            "definition": "Amount of Calcium in one serving of health supplement B",
            "symbol": "CaB",
            "value": 60,
            "shape": []
        },
        {
            "definition": "Amount of Magnesium in one serving of health supplement B",
            "symbol": "MgB",
            "value": 10,
            "shape": []
        },
        {
            "definition": "Cost per serving of health supplement A",
            "symbol": "CostA",
            "value": 14,
            "shape": []
        },
        {
            "definition": "Cost per serving of health supplement B",
            "symbol": "CostB",
            "value": 25,
            "shape": []
        },
        {
            "definition": "Minimum required amount of Calcium per day",
            "symbol": "MinCa",
            "value": 400,
            "shape": []
        },
        {
            "definition": "Minimum required amount of Magnesium per day",
            "symbol": "MinMg",
            "value": 50,
            "shape": []
        }
    ]
}