{
    "background": "A tea estate has available a certain amount of land and needs to decide how to allocate the use of traditional and modern machines for picking tea leaves, taking into account the picking rate, waste generation, and fuel usage of each machine, within the available resources for fuel and waste management.",
    "constraints": [
        "Number of acres allocated to the traditional machine is a non-negative integer",
        "Number of acres allocated to the modern machine is a non-negative integer",
        "Sum of acres allocated to both machines cannot exceed TotalAcres",
        "Total fuel used by both machines cannot exceed TotalFuel",
        "Total waste generated by both machines cannot exceed MaxWaste",
        "Fuel used by traditional machine <= (TradFuelUse * acres allocated to traditional machine)",
        "Fuel used by modern machine <= (ModFuelUse * acres allocated to modern machine)",
        "Waste from traditional machine <= (TradWasteRate * acres allocated to traditional machine)",
        "Waste from modern machine <= (ModWasteRate * acres allocated to modern machine)"
    ],
    "objective": "Maximize the total amount of tea leaves picked by both machines",
    "description": "A tea estate has available \\param{TotalAcres} acres of land and they need to pick the tea leaves either using a traditional machine or modern machine. For each acre of land, the traditional machine can pick \\param{TradPickRate} kg of tea leaves, creates \\param{TradWasteRate} kg of waste, and requires \\param{TradFuelUse} liters of fuel. For each acre of land, the modern machine can pick \\param{ModPickRate} kg of tea leaves, creates \\param{ModWasteRate} kg of waste, and requires \\param{ModFuelUse} liters of fuel. The estate has available \\param{TotalFuel} liters of fuel and can handle at most \\param{MaxWaste} kg of waste. For how many acres should each machine be used to maximize the amount of tea leaves that can be picked?",
    "parameters": [
        {
            "definition": "Total acres of land available for picking tea leaves",
            "symbol": "TotalAcres",
            "value": 500,
            "shape": []
        },
        {
            "definition": "Amount of tea leaves picked by the traditional machine per acre",
            "symbol": "TradPickRate",
            "value": 30,
            "shape": []
        },
        {
            "definition": "Amount of waste created by the traditional machine per acre",
            "symbol": "TradWasteRate",
            "value": 10,
            "shape": []
        },
        {
            "definition": "Fuel required by the traditional machine per acre",
            "symbol": "TradFuelUse",
            "value": 20,
            "shape": []
        },
        {
            "definition": "Amount of tea leaves picked by the modern machine per acre",
            "symbol": "ModPickRate",
            "value": 40,
            "shape": []
        },
        {
            "definition": "Amount of waste created by the modern machine per acre",
            "symbol": "ModWasteRate",
            "value": 15,
            "shape": []
        },
        {
            "definition": "Fuel required by the modern machine per acre",
            "symbol": "ModFuelUse",
            "value": 15,
            "shape": []
        },
        {
            "definition": "Total available fuel for picking tea leaves",
            "symbol": "TotalFuel",
            "value": 9000,
            "shape": []
        },
        {
            "definition": "Maximum waste handling capacity",
            "symbol": "MaxWaste",
            "value": 6000,
            "shape": []
        }
    ]
}