{
    "background": "A construction company uses cows and elephants to transport bricks. Each animal has a limited carrying capacity, and the company seeks to minimize the number of animals while meeting a minimum transport requirement.",
    "constraints": [
        "Number of elephants cannot exceed number of cows",
        "There must be at most MaxCowElephantRatio cows for each elephant",
        "The total number of bricks carried must meet or exceed MinBricks",
        "Number of cows is non-negative",
        "Number of elephants is non-negative"
    ],
    "objective": "Minimize the total number of animals (cows and elephants)",
    "description": "A construction company in the tropics uses cows and elephants to carry bricks. A cow can carry \\param{CapacityCow} bricks on its back while an elephant can carry \\param{CapacityElephant} bricks on its back. To avoid having elephants create too much traffic, the number of elephants cannot exceed the number of cows (\\param{MaxElephantsToCows}). In addition, there can be at most \\param{MaxCowElephantRatio} times the number of cows as elephants. If the company needs to transport at least \\param{MinBricks} bricks, find the minimum number of animals, cows and elephants, that can be used.",
    "parameters": [
        {
            "definition": "Number of bricks a cow can carry",
            "symbol": "CapacityCow",
            "value": 20,
            "shape": []
        },
        {
            "definition": "Number of bricks an elephant can carry",
            "symbol": "CapacityElephant",
            "value": 50,
            "shape": []
        },
        {
            "definition": "Minimum number of bricks required to be transported",
            "symbol": "MinBricks",
            "value": 1000,
            "shape": []
        },
        {
            "definition": "Maximum ratio of cows to elephants",
            "symbol": "MaxCowElephantRatio",
            "value": 2.0,
            "shape": []
        },
        {
            "definition": "Maximum number of elephants relative to the number of cows",
            "symbol": "MaxElephantsToCows",
            "value": 1.0,
            "shape": []
        }
    ]
}