{
    "background": "A mall is looking to purchase two types of hand sanitizer machines, motion activated and manual, with considerations for hygiene, drop delivery rate, and energy consumption.",
    "constraints": [
        "The number of motion activated machines is non-negative",
        "The number of manual machines is non-negative",
        "At most MaxManualFraction of the total machines can be manual",
        "At least MinMotionMachines should be motion activated",
        "The mall must deliver at least MinDropsPerMinute drops per minute",
        "The energy consumption cannot exceed MaxEnergyPerMinute kWh per minute"
    ],
    "objective": "Minimize the total number of hand sanitizer machines the mall should buy",
    "description": "A mall buys two types of hand sanitizer machines, a motion activated one and a manual one. The motion activated one can deliver \\param{MotionDropsPerMinute} drops per minute and consumes \\param{MotionConsumption} kWh. The manual one can deliver \\param{ManualDropsPerMinute} drops per minute and consumes \\param{ManualConsumption} kWh. Since the motion activated one is more hygienic, at most \\param{MaxManualFraction} of the machines can be manual. In addition, at least \\param{MinMotionMachines} should be motion activated. If the mall must be able to deliver at least \\param{MinDropsPerMinute} drops per minute and can use at most \\param{MaxEnergyPerMinute} kWh per minute, how many of each machine should they buy to minimize the total number of machines?",
    "parameters": [
        {
            "definition": "Number of drops per minute a motion activated machine can deliver",
            "symbol": "MotionDropsPerMinute",
            "value": 50,
            "shape": []
        },
        {
            "definition": "Energy consumption of a motion activated machine in kWh",
            "symbol": "MotionConsumption",
            "value": 30,
            "shape": []
        },
        {
            "definition": "Number of drops per minute a manual machine can deliver",
            "symbol": "ManualDropsPerMinute",
            "value": 75,
            "shape": []
        },
        {
            "definition": "Energy consumption of a manual machine in kWh",
            "symbol": "ManualConsumption",
            "value": 20,
            "shape": []
        },
        {
            "definition": "Maximum fraction of machines that can be manual",
            "symbol": "MaxManualFraction",
            "value": 0.4,
            "shape": []
        },
        {
            "definition": "Minimum number of motion activated machines required",
            "symbol": "MinMotionMachines",
            "value": 3,
            "shape": []
        },
        {
            "definition": "Minimum number of total drops per minute required",
            "symbol": "MinDropsPerMinute",
            "value": 1000,
            "shape": []
        },
        {
            "definition": "Maximum allowable energy consumption in kWh per minute",
            "symbol": "MaxEnergyPerMinute",
            "value": 500,
            "shape": []
        }
    ]
}