{
    "background": "A manufacturer produces P different parts using M machines. Each machine has specific time requirements and costs associated with producing the parts, as well as defined availability, standard and overtime operational costs, and a limited number of overtime hours. The manufacturer seeks to determine the monthly production batches for each part to satisfy demand while aiming for a certain profit level.",
    "constraints": [
        "Each machine's use time per part must not exceed the machine's availability",
        "Each machine has a limited number of overtime hours that can be used",
        "There is a minimum number of batches to be produced for each part",
        "The total standard and overtime costs must enable achieving a minimum target profit",
        "All produced batches for each part must be non-negative",
        "The time used on each machine when producing parts must be non-negative",
        "Overtime used on each machine must be non-negative and cannot exceed the available overtime hours"
    ],
    "objective": "Determine the optimal quantity of batches for each part to maximize the manufacturer's monthly profit, given machine availability and costs, while meeting the minimum batch requirements and not exceeding the overtime limits.",
    "description": "Determine the quantity of batches for each part the manufacturer should produce every month, ensuring all constraints are met, where the manufacturer has \\param{P} different parts, \\param{M} machines, \\param{TimeRequired} matrix indicating the time each machine takes to produce a part, \\param{MachineCosts} indicating the cost of each machine, \\param{Availability} of each machine, \\param{Prices} of each part, \\param{MinBatches} required for each part, a \\param{StandardCost} of running a machine per hour, an \\param{OvertimeCost} for running a machine beyond the standard hours, an \\param{OvertimeHour} available for overtime work for each machine, and a \\param{MinProfit} that the manufacturer aims to achieve.",
    "parameters": [
        {
            "definition": "Number of machines",
            "symbol": "M",
            "value": "",
            "shape": []
        },
        {
            "definition": "Number of parts to be produced",
            "symbol": "P",
            "value": "",
            "shape": []
        },
        {
            "definition": "Time required to produce each part 'p' on machine 'm'",
            "symbol": "TimeRequired",
            "value": "",
            "shape": [
                "M",
                "P"
            ]
        },
        {
            "definition": "Cost associated with each machine 'm'",
            "symbol": "MachineCosts",
            "value": "",
            "shape": [
                "M"
            ]
        },
        {
            "definition": "Availability in hours of each machine 'm' per month",
            "symbol": "Availability",
            "value": "",
            "shape": [
                "M"
            ]
        },
        {
            "definition": "Price obtained from selling each part 'p'",
            "symbol": "Prices",
            "value": "",
            "shape": [
                "P"
            ]
        },
        {
            "definition": "Minimum number of batches of part 'p' that must be produced",
            "symbol": "MinBatches",
            "value": "",
            "shape": [
                "P"
            ]
        },
        {
            "definition": "Standard cost for a machine to run for one hour",
            "symbol": "StandardCost",
            "value": "",
            "shape": []
        },
        {
            "definition": "Overtime cost for a machine to run for one hour beyond the standard availability",
            "symbol": "OvertimeCost",
            "value": "",
            "shape": []
        },
        {
            "definition": "Numbers of overtime hours available for a machine to run beyond standard availability",
            "symbol": "OvertimeHour",
            "value": "",
            "shape": []
        },
        {
            "definition": "The minimum profit the manufacturer wants to achieve",
            "symbol": "MinProfit",
            "value": "",
            "shape": []
        }
    ]
}