{
    "background": "A suspicious factory has limited space and wants to allocate it for the production of bootleg phones and laptops, each with associated costs and labor hours, to maximize revenue while not exceeding budget and labor constraints.",
    "constraints": [
        "Square footage allocated for phone production is non-negative",
        "Square footage allocated for laptop production is non-negative",
        "Space used for both phones and laptops does not exceed S",
        "Labor used for phone production does not exceed BudgetMax",
        "Labor used for laptop production does not exceed BudgetMax",
        "Total labor hours for phone and laptop production does not exceed LaborMax",
        "Total cost for phone production does not exceed BudgetMax",
        "Total cost for laptop production does not exceed BudgetMax"
    ],
    "objective": "Maximize the revenue from the production of phones and laptops",
    "description": "A suspicious factory has \\var{S} sq. feet of space. It makes bootleg phones and laptops. Phones require \\var{LPhone} hours of labor and cost \\var{CPhone} for each sq. foot of space allocated for phone production (cost of electricity and equipment). Laptops require \\var{LLaptop} hours of labor and cost \\var{CLaptop} for each sq. foot of space allocated for laptop production. Phones produce a net revenue of \\var{RPhone} per sq. foot while laptops produce a net revenue of \\var{RLaptop} per sq. foot. The factory wants to spend at most \\var{BudgetMax} and \\var{LaborMax} hours of labor. What is the optimal factory layout to maximize revenue?",
    "parameters": [
        {
            "definition": "Total factory space in square feet",
            "symbol": "S",
            "value": 100,
            "shape": []
        },
        {
            "definition": "Labor hours required to produce one phone",
            "symbol": "LPhone",
            "value": 2,
            "shape": []
        },
        {
            "definition": "Labor hours required to produce one laptop",
            "symbol": "LLaptop",
            "value": 3,
            "shape": []
        },
        {
            "definition": "Cost per square foot of space for phone production",
            "symbol": "CPhone",
            "value": 12,
            "shape": []
        },
        {
            "definition": "Cost per square foot of space for laptop production",
            "symbol": "CLaptop",
            "value": 15,
            "shape": []
        },
        {
            "definition": "Net revenue per square foot from phone production",
            "symbol": "RPhone",
            "value": 50,
            "shape": []
        },
        {
            "definition": "Net revenue per square foot from laptop production",
            "symbol": "RLaptop",
            "value": 70,
            "shape": []
        },
        {
            "definition": "Maximum budget for production",
            "symbol": "BudgetMax",
            "value": 5000,
            "shape": []
        },
        {
            "definition": "Maximum labor hours available",
            "symbol": "LaborMax",
            "value": 2000,
            "shape": []
        }
    ]
}