{
    "parameters": [
        {
            "definition": "Stamping capacity per minute of dual model stamping machine",
            "symbol": "DualCap",
            "value": 50,
            "shape": []
        },
        {
            "definition": "Stamping capacity per minute of single model stamping machine",
            "symbol": "SingleCap",
            "value": 30,
            "shape": []
        },
        {
            "definition": "Glue consumption per minute of dual model stamping machine",
            "symbol": "DualGlue",
            "value": 20,
            "shape": []
        },
        {
            "definition": "Glue consumption per minute of single model stamping machine",
            "symbol": "SingleGlue",
            "value": 15,
            "shape": []
        },
        {
            "definition": "Minimum total letters stamped per minute",
            "symbol": "MinLetters",
            "value": 300,
            "shape": []
        },
        {
            "definition": "Maximum glue consumption per minute",
            "symbol": "MaxGlue",
            "value": 135,
            "shape": []
        }
    ],
    "description": "A post office is buying stamping machines and they can buy a dual or single model stamping machine. A dual model stamping machine can stamp \\param{DualCap} letters per minute while a single model stamping machine can stamp \\param{SingleCap} letters per minute. The dual model stamping machine requires \\param{DualGlue} units of glue per minute while the single model stamping machine requires \\param{SingleGlue} units of glue per minute. Since the single model stamping machine is quieter, the number of single model stamping machines must be more than the number of dual model stamping machines. Further, the post office wants to make sure they can stamp at least \\param{MinLetters} letters per minute and use at most \\param{MaxGlue} units of glue per minute. How many of each stamping machine should they purchase to minimize the total number of stamping machines?"
}