{
    "background": "A parent is trying to plan the servings of two flavors of baby food, apple and carrot, to satisfy their baby's fat and folate nutritional requirements while adhering to the baby's preference for apple flavor over carrot flavor.",
    "constraints": [
        "Number of servings of apple flavored baby food is non-negative",
        "Number of servings of carrot flavored baby food is non-negative",
        "The baby must eat AppleCarrotRatio times as many apple flavored servings as carrot flavored servings",
        "The baby must eat at least MinServingsCarrot servings of carrot flavored baby food",
        "The baby can consume at most MaxFolate units of folate"
    ],
    "objective": "Maximize the baby's fat intake from the servings of apple and carrot flavored baby food",
    "description": "A parent feeds their baby two flavors of baby food, apple and carrot, in order to meet the babies fat and folate requirements. Each serving of apple flavored baby food contains \\param{FatApple} units of fat and \\param{FolateApple} units of folate. Each serving of carrot flavored baby food contains \\param{FatCarrot} units of fat and \\param{FolateCarrot} units of folate. The baby does not like the carrot flavor, and therefore he must eat \\param{AppleCarrotRatio} times as many apple flavored baby food as carrot flavored baby food. However, he must eat at least \\param{MinServingsCarrot} servings of carrot flavored baby food. If the baby can consume at most \\param{MaxFolate} units of folate, how many servings of each should he eat to maximize his fat intake?",
    "parameters": [
        {
            "definition": "Units of fat in each serving of apple flavored baby food",
            "symbol": "FatApple",
            "value": 2,
            "shape": []
        },
        {
            "definition": "Units of folate in each serving of apple flavored baby food",
            "symbol": "FolateApple",
            "value": 5,
            "shape": []
        },
        {
            "definition": "Units of fat in each serving of carrot flavored baby food",
            "symbol": "FatCarrot",
            "value": 4,
            "shape": []
        },
        {
            "definition": "Units of folate in each serving of carrot flavored baby food",
            "symbol": "FolateCarrot",
            "value": 3,
            "shape": []
        },
        {
            "definition": "Minimum number of servings of carrot flavored baby food",
            "symbol": "MinServingsCarrot",
            "value": 2,
            "shape": []
        },
        {
            "definition": "Multiplied number of apple servings compared to carrot servings",
            "symbol": "AppleCarrotRatio",
            "value": 3,
            "shape": []
        },
        {
            "definition": "Maximum units of folate that the baby can consume",
            "symbol": "MaxFolate",
            "value": 100,
            "shape": []
        }
    ]
}