{
    "background": "A company is deciding where to promote their product with options including z-tube, soorchle engine, and wassa advertisements.",
    "constraints": [
        "Number of z-tube ads is an integer",
        "Number of soorchle ads is an integer",
        "Number of wassa ads is an integer",
        "Number of z-tube ads is non-negative",
        "Number of soorchle ads is non-negative",
        "Number of wassa ads is non-negative",
        "Total spending on z-tube ads does not exceed Budget",
        "Total spending on soorchle ads does not exceed Budget",
        "Total spending on wassa ads does not exceed Budget",
        "The sum of spending on z-tube, soorchle, and wassa ads does not exceed Budget",
        "Number of soorchle ads is at most MaxAdsSoorchle",
        "Number of wassa ads is at most MaxPropWassa times the total number of ads",
        "Number of z-tube ads is at least MinPropZtube times the total number of ads"
    ],
    "objective": "Maximize the total number of viewers from ads across all platforms",
    "description": "A company is deciding where to promote their product. Some options include z-tube, soorchle engine, and wassa advertisements. The cost for each option and the number of viewers they each attract is given. On z-tube, each ad costs \\$\\var{CostZtube} and attracts \\var{ViewersZtube} viewers. On soorchle, each ad costs \\$\\var{CostSoorchle} and attracts \\var{ViewersSoorchle} viewers. On wassa, each ad costs \\$\\var{CostWassa} and attracts \\var{ViewersWassa} viewers. Soorchle limits the number of advertisements from a single company to \\var{MaxAdsSoorchle}. Moreover, in order to balance the advertising among the three types of media, at most \\var{MaxPropWassa} of the total number of advertisements should occur on wassa. And at least \\var{MinPropZtube} should occur on z-tube. The weekly advertising budget is \\$\\var{Budget}. How many advertisements should be run in each of the three types of media to maximize the total audience?",
    "parameters": [
        {
            "definition": "Cost of an advertisement on z-tube",
            "symbol": "CostZtube",
            "value": 1000,
            "shape": []
        },
        {
            "definition": "Number of viewers attracted by an advertisement on z-tube",
            "symbol": "ViewersZtube",
            "value": 400000,
            "shape": []
        },
        {
            "definition": "Cost of an advertisement on soorchle",
            "symbol": "CostSoorchle",
            "value": 200,
            "shape": []
        },
        {
            "definition": "Number of viewers attracted by an advertisement on soorchle",
            "symbol": "ViewersSoorchle",
            "value": 5000,
            "shape": []
        },
        {
            "definition": "Cost of an advertisement on wassa",
            "symbol": "CostWassa",
            "value": 100,
            "shape": []
        },
        {
            "definition": "Number of viewers attracted by an advertisement on wassa",
            "symbol": "ViewersWassa",
            "value": 3000,
            "shape": []
        },
        {
            "definition": "Maximum number of advertisements allowed on soorchle",
            "symbol": "MaxAdsSoorchle",
            "value": 15,
            "shape": []
        },
        {
            "definition": "Maximum proportion of the total number of advertisements that should occur on wassa",
            "symbol": "MaxPropWassa",
            "value": 0.33,
            "shape": []
        },
        {
            "definition": "Minimum proportion of the total number of advertisements that should occur on z-tube",
            "symbol": "MinPropZtube",
            "value": 0.05,
            "shape": []
        },
        {
            "definition": "Weekly advertising budget",
            "symbol": "Budget",
            "value": 10000,
            "shape": []
        }
    ]
}