{
    "background": "A researcher needs to outsource image annotations and has two companies to choose from with different annotations rates and charges. Part of the dataset requires a specialized company for annotation.",
    "constraints": [
        "Number of images annotated by the specialized company is non-negative",
        "Number of images annotated by the common company is non-negative",
        "Total number of images annotated must be at least MinimumImages",
        "At least MinimumSpecializedProportion of the work must be allocated to the specialized company"
    ],
    "objective": "Minimize the total cost of annotating the dataset",
    "description": "A researcher is outsourcing annotations and has two options: a specialized third-party or a common third-party annotation company. The specialized company can annotate at a rate of \\param{SpecializedRate} images per hour whereas the common company can annotate at a rate of \\param{CommonRate} images per hour. However, the specialized company charges \\param{SpecializedCharge} per hour and the common company charges \\param{CommonCharge} per hour. The researcher has deadlines to meet and must complete a dataset of at least \\param{MinimumImages} images. They also have some special images that only the specialized company can annotate. Therefore, at least a \\param{MinimumSpecializedProportion} of work must be allocated to the specialized company. How should the researcher distribute the annotations to the two companies to minimize the cost of annotating the whole dataset?",
    "parameters": [
        {
            "definition": "Annotation rate of the specialized company",
            "symbol": "SpecializedRate",
            "value": 60,
            "shape": []
        },
        {
            "definition": "Annotation rate of the common company",
            "symbol": "CommonRate",
            "value": 40,
            "shape": []
        },
        {
            "definition": "Hourly charge of the specialized company",
            "symbol": "SpecializedCharge",
            "value": 100,
            "shape": []
        },
        {
            "definition": "Hourly charge of the common company",
            "symbol": "CommonCharge",
            "value": 72,
            "shape": []
        },
        {
            "definition": "Minimum number of images to be annotated",
            "symbol": "MinimumImages",
            "value": 10000,
            "shape": []
        },
        {
            "definition": "Minimum proportion of work to be allocated to the specialized company",
            "symbol": "MinimumSpecializedProportion",
            "value": 0.33,
            "shape": []
        }
    ]
}